{"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 164], "dtype": "float32", "sparse": false, "ragged": false, "name": "frames"}, "name": "frames", "inbound_nodes": []}, {"class_name": "Masking", "config": {"name": "masking", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 128, 164], "mask_value": 0.0}, "name": "masking", "inbound_nodes": [[["frames", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {}, "name": "embedding", "inbound_nodes": [[["masking", 0, 0, {}]]]}, {"class_name": "Encoder", "config": {"num_blocks": 3}, "name": "encoder", "inbound_nodes": [[["embedding", 0, 0, {"x_inp": ["frames", 0, 0]}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "int32", "sparse": false, "ragged": false, "name": "phrase"}, "name": "phrase", "inbound_nodes": []}, {"class_name": "Decoder", "config": {"num_blocks": 2}, "name": "decoder", "inbound_nodes": [[["encoder", 0, 0, {"attention_mask": ["encoder", 0, 1], "phrase": ["phrase", 0, 0]}]]]}, {"class_name": "Sequential", "config": {"name": "classifier", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 384], "dtype": "float32", "sparse": false, "ragged": false, "name": "dropout_11_input"}}, {"class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_88", "trainable": true, "dtype": "float32", "units": 62, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "classifier", "inbound_nodes": [[["decoder", 0, 0, {}]]]}], "input_layers": [["frames", 0, 0], ["phrase", 0, 0]], "output_layers": [["classifier", 1, 0]]}, "keras_version": "2.12.0", "backend": "tensorflow"}